GeFengthe/RTL8762/board/evb/fireswitch/app/skyswitch.c


#include <stddef.h>    // standard definitions
#include <stdint.h>    // standard integer definition
#include <math.h>
#include "platform_os.h"
#include "rtl876x_gpio.h"
#include "rtl876x_pinmux.h"
#include "rtl876x_rcc.h"
#include "skyswitch.h"
#include "trace.h"

#include "data_uart.h"
#include "app_skyiot_dlps.h"

// #define APP_DBG_PRINTF(fmt, ...)
#define APP_DBG_PRINTF   DBG_DIRECT

#define LED_RED    LEDTURNOFF 
#define LED_BLUE   LEDTURNON  
#define LED_BLINK  LEDBLINK  

#define SWITCH1_RELAY_CTL_USED  1
#if SWITCH1_RELAY_CTL_USED == 1
// 这里IO统一在tmr里面处理，如有例外加保护，注意重入
#if (SKY_SWITCH_TYPE == SKY_ONEWAYSWITCH_TYPE)
#define SWITCH1_RELAYON_GPIO          P3_2
#define SWITCH1_RELAYON_GPIO_PIN      GPIO_GetPin(SWITCH1_RELAYON_GPIO)
#define SWITCH1_RELAYOFF_GPIO         P4_0
#define SWITCH1_RELAYOFF_GPIO_PIN     GPIO_GetPin(SWITCH1_RELAYOFF_GPIO)
static uint8_t RelayOnIO[SKYSWITC_NUMBERS]  = {SWITCH1_RELAYON_GPIO };
static uint8_t RelayOffIO[SKYSWITC_NUMBERS] = {SWITCH1_RELAYOFF_GPIO };

#elif (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE)
#define SWITCH1_RELAYON_GPIO          P3_2
#define SWITCH1_RELAYON_GPIO_PIN      GPIO_GetPin(SWITCH1_RELAYON_GPIO)
#define SWITCH1_RELAYOFF_GPIO         P4_0
#define SWITCH1_RELAYOFF_GPIO_PIN     GPIO_GetPin(SWITCH1_RELAYOFF_GPIO)

#define SWITCH2_RELAYON_GPIO          P3_3
#define SWITCH2_RELAYON_GPIO_PIN      GPIO_GetPin(SWITCH2_RELAYON_GPIO)
#define SWITCH2_RELAYOFF_GPIO         P4_1
#define SWITCH2_RELAYOFF_GPIO_PIN     GPIO_GetPin(SWITCH2_RELAYOFF_GPIO)
static uint8_t RelayOnIO[SKYSWITC_NUMBERS]  = {SWITCH1_RELAYON_GPIO, SWITCH2_RELAYON_GPIO};
static uint8_t RelayOffIO[SKYSWITC_NUMBERS] = {SWITCH1_RELAYOFF_GPIO, SWITCH2_RELAYOFF_GPIO};

#elif (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
#define SWITCH1_RELAYON_GPIO          P3_2
#define SWITCH1_RELAYON_GPIO_PIN      GPIO_GetPin(SWITCH1_RELAYON_GPIO)
#define SWITCH1_RELAYOFF_GPIO         P4_0
#define SWITCH1_RELAYOFF_GPIO_PIN     GPIO_GetPin(SWITCH1_RELAYOFF_GPIO)

#define SWITCH2_RELAYON_GPIO          P3_3
#define SWITCH2_RELAYON_GPIO_PIN      GPIO_GetPin(SWITCH2_RELAYON_GPIO)
#define SWITCH2_RELAYOFF_GPIO         P4_1
#define SWITCH2_RELAYOFF_GPIO_PIN     GPIO_GetPin(SWITCH2_RELAYOFF_GPIO)

#define SWITCH3_RELAYON_GPIO          P0_5  
#define SWITCH3_RELAYON_GPIO_PIN      GPIO_GetPin(SWITCH3_RELAYON_GPIO)
#define SWITCH3_RELAYOFF_GPIO         P0_6  
#define SWITCH3_RELAYOFF_GPIO_PIN     GPIO_GetPin(SWITCH3_RELAYOFF_GPIO)
static uint8_t RelayOnIO[SKYSWITC_NUMBERS]  = {SWITCH1_RELAYON_GPIO, SWITCH2_RELAYON_GPIO, SWITCH3_RELAYON_GPIO};
static uint8_t RelayOffIO[SKYSWITC_NUMBERS] = {SWITCH1_RELAYOFF_GPIO, SWITCH2_RELAYOFF_GPIO, SWITCH3_RELAYOFF_GPIO};
#endif

#endif

#if (SKY_SWITCH_TYPE == SKY_ONEWAYSWITCH_TYPE)
#define SWITCH1_GPIO             P2_3  
#define SWITCH1_GPIO_PIN         GPIO_GetPin(SWITCH1_GPIO)
static uint8_t SwitchIO[SKYSWITC_NUMBERS]={SWITCH1_GPIO};

#elif (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE)
#define SWITCH1_GPIO             P2_4  
#define SWITCH1_GPIO_PIN         GPIO_GetPin(SWITCH1_GPIO)
#define SWITCH2_GPIO             P2_2
#define SWITCH2_GPIO_PIN         GPIO_GetPin(SWITCH2_GPIO)
static uint8_t SwitchIO[SKYSWITC_NUMBERS]={SWITCH1_GPIO, SWITCH2_GPIO};

#elif (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
#define SWITCH1_GPIO             P2_4  
#define SWITCH1_GPIO_PIN         GPIO_GetPin(SWITCH1_GPIO)
#define SWITCH2_GPIO             P2_3
#define SWITCH2_GPIO_PIN         GPIO_GetPin(SWITCH2_GPIO)
#define SWITCH3_GPIO             P2_2
#define SWITCH3_GPIO_PIN         GPIO_GetPin(SWITCH3_GPIO)
static uint8_t SwitchIO[SKYSWITC_NUMBERS]={SWITCH1_GPIO, SWITCH2_GPIO, SWITCH3_GPIO};
#endif

// 过零检查,用中断实现
#define CHECK_ZVD_GPIO               P2_5 
#define CHECK_ZVD_GPIO_PIN           GPIO_GetPin(CHECK_ZVD_GPIO)
#define CHECK_ZVD_PIN_INPUT_IRQN     GPIO21_IRQn
#define CHECK_ZVD_PIN_INPUT_Handler  GPIO21_Handler

#define PROVISION_LED_GPIO       P2_7
#define PROVISION_LED_GPIO_PIN   GPIO_GetPin(PROVISION_LED_GPIO)

#define MAXPRESSTIME_5S   (100)  // 50ms定时器调用
typedef enum{
	SCAN_KEY_INIT = 0x00,
	SCAN_KEY_PRESS,    
	SCAN_KEY_PRESS_CONFIRM,    
	SCAN_KEY_RELEASE,
}SCAN_KEY_STATUS_e;

static int32_t presstime=0;
static SCAN_KEY_STATUS_e keystatus = SCAN_KEY_INIT;
static KEY_PRESS_MODE_e  keymode   = KEY_MODE_INIT;

static SkySwitchManager *mSwitchManager=NULL;

static bool BlinkProLed=false;
/*
** GPIO
*/
static void HAL_GpioForSwitch_Init(void)
{
	/* Configure pad and pinmux firstly! */
	Pad_Config(SwitchIO[SKYSWITC1_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    Pinmux_Config(SwitchIO[SKYSWITC1_ENUM], DWGPIO);	
	#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
	Pad_Config(SwitchIO[SKYSWITC2_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    Pinmux_Config(SwitchIO[SKYSWITC2_ENUM], DWGPIO);
	#endif	
	#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
	Pad_Config(SwitchIO[SKYSWITC3_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    Pinmux_Config(SwitchIO[SKYSWITC3_ENUM], DWGPIO);
	#endif
	
	Pad_Config(CHECK_ZVD_GPIO, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    Pinmux_Config(CHECK_ZVD_GPIO, DWGPIO);
	
	#if SWITCH1_RELAY_CTL_USED == 1	
	Pad_Config(RelayOnIO[SKYSWITC1_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pinmux_Config(RelayOnIO[SKYSWITC1_ENUM], DWGPIO);
	Pad_Config(RelayOffIO[SKYSWITC1_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pinmux_Config(RelayOffIO[SKYSWITC1_ENUM], DWGPIO);
	#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
	Pad_Config(RelayOnIO[SKYSWITC2_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pinmux_Config(RelayOnIO[SKYSWITC2_ENUM], DWGPIO);
	Pad_Config(RelayOffIO[SKYSWITC2_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pinmux_Config(RelayOffIO[SKYSWITC2_ENUM], DWGPIO);
	#endif	
	#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
	Pad_Config(RelayOnIO[SKYSWITC3_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pinmux_Config(RelayOnIO[SKYSWITC3_ENUM], DWGPIO);	
	Pad_Config(RelayOffIO[SKYSWITC3_ENUM], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pinmux_Config(RelayOffIO[SKYSWITC3_ENUM], DWGPIO);
	#endif
	#endif
	
	Pad_Config(PROVISION_LED_GPIO, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pinmux_Config(PROVISION_LED_GPIO, DWGPIO);
	
	
    /* Initialize GPIO peripheral */
    RCC_PeriphClockCmd(APBPeriph_GPIO, APBPeriph_GPIO_CLOCK, ENABLE);

    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_StructInit(&GPIO_InitStruct);	
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(SwitchIO[SKYSWITC1_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_IN;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(SwitchIO[SKYSWITC2_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_IN;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	#endif	
	#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(SwitchIO[SKYSWITC3_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_IN;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	#endif
	
