GeFengthe/RTL8762/board/evb/fireswitch/app/skyswitch.c
	#if SWITCH1_RELAY_CTL_USED == 1	
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(RelayOnIO[SKYSWITC1_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(RelayOffIO[SKYSWITC1_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(RelayOnIO[SKYSWITC2_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(RelayOffIO[SKYSWITC2_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	#endif	
	#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(RelayOnIO[SKYSWITC3_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);	
    GPIO_InitStruct.GPIO_Pin    = GPIO_GetPin(RelayOffIO[SKYSWITC3_ENUM]);
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	#endif
	#endif
	
    GPIO_InitStruct.GPIO_Pin    = PROVISION_LED_GPIO_PIN;
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	
	
    GPIO_InitStruct.GPIO_Pin    = CHECK_ZVD_GPIO_PIN;
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_IN;
	#if 1
    GPIO_InitStruct.GPIO_ITCmd  = DISABLE;
    GPIO_Init(&GPIO_InitStruct);
	#else
    GPIO_InitStruct.GPIO_ITCmd  = ENABLE;
    GPIO_InitStruct.GPIO_ITTrigger  = GPIO_INT_Trigger_LEVEL;
    GPIO_InitStruct.GPIO_ITPolarity = GPIO_INT_POLARITY_ACTIVE_HIGH;
    GPIO_InitStruct.GPIO_ITDebounce = GPIO_INT_DEBOUNCE_DISABLE;
    GPIO_Init(&GPIO_InitStruct);	
    NVIC_InitTypeDef NVIC_InitStruct;
    NVIC_InitStruct.NVIC_IRQChannel = CHECK_ZVD_PIN_INPUT_IRQN;
    NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStruct);
    GPIO_MaskINTConfig(CHECK_ZVD_GPIO_PIN, DISABLE);
    GPIO_INTConfig(CHECK_ZVD_GPIO_PIN, ENABLE);
	#endif
}

void HAL_ProvisionLed_Control(uint8_t mode)
{
	switch(mode){
		case LED_PRO_OFF:{
			GPIO_WriteBit(PROVISION_LED_GPIO_PIN, (BitAction)(LED_PRO_OFF));
		break;
		}
		case LED_PRO_ON:{
			GPIO_WriteBit(PROVISION_LED_GPIO_PIN, (BitAction)(LED_PRO_ON));
		break;
		}
		case LED_BLINK:{
			if(GPIO_ReadOutputDataBit(PROVISION_LED_GPIO_PIN)==1){
				GPIO_WriteBit(PROVISION_LED_GPIO_PIN, (BitAction)(LED_PRO_OFF));
			} else{
				GPIO_WriteBit(PROVISION_LED_GPIO_PIN, (BitAction)(LED_PRO_ON));
			}
		break;
		}
	}
}
void HAL_ProvLed_Dlps_Control(uint8_t val, bool isenter)
{
	PAD_OUTPUT_VAL outval;
	
	val = GPIO_ReadOutputDataBit(PROVISION_LED_GPIO_PIN);
	if(val){
		outval = PAD_OUT_HIGH;
	}else{
		outval = PAD_OUT_LOW;
	}
	if(isenter){
		Pad_Config(PROVISION_LED_GPIO, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, outval);
	}else{
		Pad_Config(PROVISION_LED_GPIO, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, outval);	
	}
		
}
void HAL_BlinkProLed_Enable(void)
{
	BlinkProLed = true;
}
void HAL_BlinkProLed_Disable(void)
{
	BlinkProLed = false;
}
bool HAL_BlinkProLed_Statu(void)
{
	return BlinkProLed;
}


#if SWITCH1_RELAY_CTL_USED == 1

#define TMP_WAIT_ZVD_SIGNAL_CNT   5   
plt_timer_t Sw1OnCtrl_timer = NULL;
static void HAL_Sw1Relay_OnCtl_Timeout_cb(void *timer)
{	
	static uint16_t enrtecnt=0; // 0~4:tmr计数 5:on 6:off
	static uint8_t oldzvd=1;
	
	enrtecnt++;
	APP_DBG_PRINTF("%s Read_ZVD_Statu:%02X r\n",__func__, enrtecnt);
	if(enrtecnt < TMP_WAIT_ZVD_SIGNAL_CNT){
		if(Read_ZVD_Statu()!=oldzvd){ 
			
			if(oldzvd==1){
				enrtecnt = TMP_WAIT_ZVD_SIGNAL_CNT-1;
				plt_timer_change_period(Sw1OnCtrl_timer, 6, 0);
				return;
			}
		}
		oldzvd = Read_ZVD_Statu();
	}	
	else if( enrtecnt == TMP_WAIT_ZVD_SIGNAL_CNT ){ // on
		if(mSwitchManager->status[SKYSWITC1_ENUM] == 0){
			GPIO_WriteBit(GPIO_GetPin(RelayOffIO[SKYSWITC1_ENUM]), Bit_SET);	
		}else{
			GPIO_WriteBit(GPIO_GetPin(RelayOnIO[SKYSWITC1_ENUM]), Bit_SET);	
		}			
		
		if(Sw1OnCtrl_timer){
			plt_timer_change_period(Sw1OnCtrl_timer, 20, 0);
		}
		enrtecnt++;
	} else if(enrtecnt>TMP_WAIT_ZVD_SIGNAL_CNT){ // ==6 off
		
		if(mSwitchManager->status[SKYSWITC1_ENUM] == 0){
			GPIO_WriteBit(GPIO_GetPin(RelayOffIO[SKYSWITC1_ENUM]), Bit_RESET);	
		}else{
			GPIO_WriteBit(GPIO_GetPin(RelayOnIO[SKYSWITC1_ENUM]), Bit_RESET);	
		}
		
		if(Sw1OnCtrl_timer){
			plt_timer_stop(Sw1OnCtrl_timer, 0);
			Switch_Relay1_tmr_ctrl_dlps(true);
		}
		
		enrtecnt = 0;
		
	}
}
#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
plt_timer_t Sw2OnCtrl_timer = NULL;
static void HAL_Sw2Relay_OnCtl_Timeout_cb(void *timer)
{	
	static uint16_t enrtecnt=0; // 0~4:tmr计数 5:on 6:off
	static uint8_t oldzvd=1;
	
	enrtecnt++;
	APP_DBG_PRINTF("%s Read_ZVD_Statu:%02X r\n",__func__, enrtecnt);
	if(enrtecnt < TMP_WAIT_ZVD_SIGNAL_CNT){
		if(Read_ZVD_Statu()!=oldzvd){ 
			if(oldzvd==1){
				enrtecnt = TMP_WAIT_ZVD_SIGNAL_CNT-1;
				plt_timer_change_period(Sw2OnCtrl_timer, 6, 0);
				return;
			}
		}
		oldzvd = Read_ZVD_Statu();
	}	
	else if( enrtecnt == TMP_WAIT_ZVD_SIGNAL_CNT ){ // on
		if(mSwitchManager->status[SKYSWITC2_ENUM] == 0){
			GPIO_WriteBit(GPIO_GetPin(RelayOffIO[SKYSWITC2_ENUM]), Bit_SET);	
		}else{
			GPIO_WriteBit(GPIO_GetPin(RelayOnIO[SKYSWITC2_ENUM]), Bit_SET);	
		}			
		
		if(Sw2OnCtrl_timer){
			plt_timer_change_period(Sw2OnCtrl_timer, 20, 0);
		}
		enrtecnt++;
	} else if(enrtecnt>TMP_WAIT_ZVD_SIGNAL_CNT){ // ==6 off
		
		if(mSwitchManager->status[SKYSWITC2_ENUM] == 0){
			GPIO_WriteBit(GPIO_GetPin(RelayOffIO[SKYSWITC2_ENUM]), Bit_RESET);	
		}else{
			GPIO_WriteBit(GPIO_GetPin(RelayOnIO[SKYSWITC2_ENUM]), Bit_RESET);	
		}
		
		if(Sw2OnCtrl_timer){
			plt_timer_stop(Sw2OnCtrl_timer, 0);
			Switch_Relay2_tmr_ctrl_dlps(true);
		}
//		data_uart_debug("%s Sw2OnCtrl_timer:%d r\n",__func__, enrtecnt);
		
		enrtecnt = 0;
		
