GeFengthe/RTL8762/board/evb/fireswitch/app/skyswitch.c
	}
}
#endif	
#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
plt_timer_t Sw3OnCtrl_timer = NULL;
static void HAL_Sw3Relay_OnCtl_Timeout_cb(void *timer)
{	
	static uint16_t enrtecnt=0; // 0~4:tmr计数 5:on 6:off
	static uint8_t oldzvd=1;
	
	enrtecnt++;
	APP_DBG_PRINTF("%s Read_ZVD_Statu:%02X r\n",__func__, enrtecnt);
	if(enrtecnt < TMP_WAIT_ZVD_SIGNAL_CNT){
		if(Read_ZVD_Statu()!=oldzvd){ 
			if(oldzvd==1){
				enrtecnt = TMP_WAIT_ZVD_SIGNAL_CNT-1;
				plt_timer_change_period(Sw3OnCtrl_timer, 6, 0);
				return;
			}
		}
		oldzvd = Read_ZVD_Statu();
	}	
	else if( enrtecnt == TMP_WAIT_ZVD_SIGNAL_CNT ){ // on
		if(mSwitchManager->status[SKYSWITC3_ENUM] == 0){
			GPIO_WriteBit(GPIO_GetPin(RelayOffIO[SKYSWITC3_ENUM]), Bit_SET);	
		}else{
			GPIO_WriteBit(GPIO_GetPin(RelayOnIO[SKYSWITC3_ENUM]), Bit_SET);	
		}			
		
		if(Sw3OnCtrl_timer){
			plt_timer_change_period(Sw3OnCtrl_timer, 20, 0);
		}
		enrtecnt++;
	} else if(enrtecnt>TMP_WAIT_ZVD_SIGNAL_CNT){ // ==6 off
		
		if(mSwitchManager->status[SKYSWITC3_ENUM] == 0){
			GPIO_WriteBit(GPIO_GetPin(RelayOffIO[SKYSWITC3_ENUM]), Bit_RESET);	
		}else{
			GPIO_WriteBit(GPIO_GetPin(RelayOnIO[SKYSWITC3_ENUM]), Bit_RESET);	
		}
		
		if(Sw3OnCtrl_timer){
			plt_timer_stop(Sw3OnCtrl_timer, 0);
			Switch_Relay3_tmr_ctrl_dlps(true);
		}
		
		enrtecnt = 0;
		
	}
}
#endif
#endif
void HAL_SwitchLed_Control(uint8_t index, uint8_t mode)
{
	APP_DBG_PRINTF("%s Read_ZVD_Statu:%02X %d r\n",__func__, index, mode);
	#if SWITCH1_RELAY_CTL_USED == 1
	if(index < SKYSWITC_NUMBERS){
		switch(mode){
			case LEDTURNON:{
				if(index == SKYSWITC1_ENUM){
					Switch_Relay1_tmr_ctrl_dlps(false);
					if(Sw1OnCtrl_timer == NULL){
						Sw1OnCtrl_timer = plt_timer_create("s1c1", 6, true, 111, HAL_Sw1Relay_OnCtl_Timeout_cb);
						if (Sw1OnCtrl_timer != NULL){
							plt_timer_start(Sw1OnCtrl_timer, 0);
						}	
					}else{		
						if(plt_timer_is_active(Sw1OnCtrl_timer)==false){
							plt_timer_change_period(Sw1OnCtrl_timer, 6, 0);
						}
					}
				} 
				#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
				else if(index == SKYSWITC2_ENUM){
					Switch_Relay2_tmr_ctrl_dlps(false);
					if(Sw2OnCtrl_timer == NULL){
						Sw2OnCtrl_timer = plt_timer_create("s2c1", 5, true, 111, HAL_Sw2Relay_OnCtl_Timeout_cb);
						if (Sw2OnCtrl_timer != NULL){
							plt_timer_start(Sw2OnCtrl_timer, 0);
						}	
					}else{		
						if(plt_timer_is_active(Sw2OnCtrl_timer)==false){
							plt_timer_change_period(Sw2OnCtrl_timer, 5, 0);
						}
					}
				} 
				#endif	
				#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
				else if(index == SKYSWITC3_ENUM){
					Switch_Relay3_tmr_ctrl_dlps(false);
					if(Sw3OnCtrl_timer == NULL){
						Sw3OnCtrl_timer = plt_timer_create("s3c1", 6, true, 111, HAL_Sw3Relay_OnCtl_Timeout_cb);
						if (Sw3OnCtrl_timer != NULL){
							plt_timer_start(Sw3OnCtrl_timer, 0);
						}	
					}else{		
						if(plt_timer_is_active(Sw3OnCtrl_timer)==false){
							plt_timer_change_period(Sw3OnCtrl_timer, 6, 0);
						}
					}
				}
				#endif	
				
			break;
			}
			case LEDTURNOFF:{
				if(index == SKYSWITC1_ENUM){
					Switch_Relay1_tmr_ctrl_dlps(false);
					if(Sw1OnCtrl_timer == NULL){
						Sw1OnCtrl_timer = plt_timer_create("s1c1", 6, true, 110, HAL_Sw1Relay_OnCtl_Timeout_cb);
						if (Sw1OnCtrl_timer != NULL){
							plt_timer_start(Sw1OnCtrl_timer, 0);
						}	
					}else{		
						if(plt_timer_is_active(Sw1OnCtrl_timer)==false){
							plt_timer_change_period(Sw1OnCtrl_timer, 6, 0);
						}
					}
				} 
				#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
				else if(index == SKYSWITC2_ENUM){
					Switch_Relay2_tmr_ctrl_dlps(false);
					if(Sw2OnCtrl_timer == NULL){
						Sw2OnCtrl_timer = plt_timer_create("s2c1", 5, true, 111, HAL_Sw2Relay_OnCtl_Timeout_cb);
						if (Sw2OnCtrl_timer != NULL){
							plt_timer_start(Sw2OnCtrl_timer, 0);
						}	
					}else{		
						if(plt_timer_is_active(Sw2OnCtrl_timer)==false){
							plt_timer_change_period(Sw2OnCtrl_timer, 5, 0);
						}
					}
				} 
				#endif	
				#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
				else if(index == SKYSWITC3_ENUM){
					Switch_Relay3_tmr_ctrl_dlps(false);					
					if(Sw3OnCtrl_timer == NULL){
						Sw3OnCtrl_timer = plt_timer_create("s3c1", 6, true, 112, HAL_Sw3Relay_OnCtl_Timeout_cb);
						if (Sw3OnCtrl_timer != NULL){
							plt_timer_start(Sw3OnCtrl_timer, 0);
						}	
					}else{		
						if(plt_timer_is_active(Sw3OnCtrl_timer)==false){
							plt_timer_change_period(Sw3OnCtrl_timer, 6, 0);
						}
					}
				}
				#endif	
			break;
			}
		}
	}	
	#endif
}

void HAL_SwitchLed_Dlps_Control(uint8_t index, uint8_t val, bool isenter)
{
	#if SWITCH1_RELAY_CTL_USED == 1
	// 这里先成对处理，可以直接给低
	PAD_OUTPUT_VAL outval;
	if(index < SKYSWITC_NUMBERS){
		outval = PAD_OUT_LOW;
		if(isenter){
			Pad_Config(RelayOnIO[index], PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, outval);
		}else{
			Pad_Config(RelayOnIO[index], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, outval);	
		}
		
		outval = PAD_OUT_LOW;
		if(isenter){
			Pad_Config(RelayOffIO[index], PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, outval);
		}else{
			Pad_Config(RelayOffIO[index], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, outval);	
		}
	}	
	#endif
}
void HAL_SwitchKey_Dlps_Control(bool isenter)
{
		if(isenter){
			Pad_Config(SWITCH1_GPIO, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
			System_WakeUpPinEnable(SWITCH1_GPIO, PAD_WAKEUP_POL_LOW, 0);
			#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
			Pad_Config(SWITCH2_GPIO, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
			System_WakeUpPinEnable(SWITCH2_GPIO, PAD_WAKEUP_POL_LOW, 0);
			#endif	
			#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
			Pad_Config(SWITCH3_GPIO, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
			System_WakeUpPinEnable(SWITCH3_GPIO, PAD_WAKEUP_POL_LOW, 0);
			#endif	
			
		}else{
			Pad_Config(SWITCH1_GPIO, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
			if(System_WakeUpInterruptValue(SWITCH1_GPIO) == 1){		// 也可读IO状态。 USE_GPIO_DLPS 须为1
				Pad_ClearWakeupINTPendingBit(SWITCH1_GPIO);
				System_WakeUpPinDisable(SWITCH1_GPIO);
				switch_io_ctrl_dlps(false);		
			}
			#if (SKY_SWITCH_TYPE == SKY_TWOWAYSWITCH_TYPE || SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
			Pad_Config(SWITCH2_GPIO, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
			if(System_WakeUpInterruptValue(SWITCH2_GPIO) == 1){		// 也可读IO状态。 USE_GPIO_DLPS 须为1
				Pad_ClearWakeupINTPendingBit(SWITCH2_GPIO);
				System_WakeUpPinDisable(SWITCH2_GPIO);
				switch_io_ctrl_dlps(false);		
			}
			#endif	
			#if (SKY_SWITCH_TYPE == SKY_THREEWAYSWITCH_TYPE)
			Pad_Config(SWITCH3_GPIO, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_HIGH);
			if(System_WakeUpInterruptValue(SWITCH3_GPIO) == 1){		// 也可读IO状态。 USE_GPIO_DLPS 须为1
				Pad_ClearWakeupINTPendingBit(SWITCH3_GPIO);
				System_WakeUpPinDisable(SWITCH3_GPIO);
				switch_io_ctrl_dlps(false);		
			}
			#endif	
	
